/** 二栋（主楼）全景房间标注 pitch/yaw · 由上级 panorama.html 合并 */
window.ROOM_DATA_BY_SCENE = {
    "二栋-1f-1": [
        { name: "140 值班室", hoverText: "140\n值班室", detailHtml: "房间号：140<br>房间名称：值班室", pitch: 3.802518251362076, yaw: -129.91048937846176 },
        { name: "131 库房", hoverText: "131\n库房", detailHtml: "房间号：131<br>房间名称：库房", pitch: 2.0263059873460256, yaw: -257.4953673595775 },
        { name: "弱电间", hoverText: "弱电间", detailHtml: "房间名称：弱电间", pitch: -3.4761917849477473, yaw: 164.84345768063747 },
        { name: "强电间", hoverText: "强电间", detailHtml: "房间名称：强电间", pitch: -2.5296440865639, yaw: 169.92317845516286 },
        { name: "储藏", hoverText: "储藏", detailHtml: "房间名称：储藏", pitch: -1.7069135792518488, yaw: 173.69877922102967 },
        { name: "监控室 / 133 实验室", hoverText: "监控室\n--\n133\n移动计算与软件实验室", detailHtml: "房间名称：监控室<br>----------------------------------------------<br>房间号：133<br>房间名称：移动计算与软件实验室", pitch: -2.603797719815197, yaw: 95.25807307825653 }
    ],
    "二栋-1f-2": [
        { name: "138 微机室", hoverText: "138\n微机室", detailHtml: "房间号：138<br>房间名称：微机室", pitch: 17.13224562307626, yaw: 47.91388389777338 }
    ],
    "二栋-1f-3": [
        { name: "133 移动计算与软件实验室(1)", hoverText: "133\n移动计算与软件实验室", detailHtml: "房间号：133<br>房间名称：移动计算与软件实验室", pitch: -2.1811338807243343, yaw: -6.78306570642183 },
        { name: "133 移动计算与软件实验室(2)", hoverText: "133\n移动计算与软件实验室", detailHtml: "房间号：133<br>房间名称：移动计算与软件实验室", pitch: -3.9184601411402737, yaw: -170.94834506590013 },
        { name: "监控室 / 131 库房", hoverText: "监控室\n--\n131\n库房", detailHtml: "房间名称：监控室<br>----------------------------------------------<br>房间号：131<br>房间名称：库房", pitch: -1.3576733170555233, yaw: -2.429261097939822 },
        { name: "洗手间", hoverText: "洗手间", detailHtml: "房间名称：洗手间", pitch: -6.121603633602158, yaw: -263.9254790652883 }
    ],
    "二栋-1f-4": [
        { name: "138 微机室(1)", hoverText: "138\n微机室", detailHtml: "房间号：138<br>房间名称：微机室", pitch: -2.1375681523047407, yaw: 116.35922486899497 },
        { name: "138 微机室(2)", hoverText: "138\n微机室", detailHtml: "房间号：138<br>房间名称：微机室", pitch: 3.857268154992085, yaw: 171.4125986626707 },
        { name: "监控室", hoverText: "监控室", detailHtml: "房间名称：监控室", pitch: 5.285310987434292, yaw: 180.71954724288315 },
        { name: "洗手间", hoverText: "洗手间", detailHtml: "房间名称：洗手间", pitch: -2.4700540502416786, yaw: -4.106925227584903 }
    ],
    "二栋-1f-5": [
        { name: "138 微机室", hoverText: "138\n微机室", detailHtml: "房间号：138<br>房间名称：微机室", pitch: 2.3720017748092608, yaw: 47.83164054409764 },
        { name: "监控室", hoverText: "监控室", detailHtml: "房间名称：监控室", pitch: 5.2360688832642985, yaw: 173.98128194748338 },
        { name: "136 值班室2(1)", hoverText: "136\n值班室2", detailHtml: "房间号：136<br>房间名称：值班室2", pitch: 2.87136010157851, yaw: 227.379007380909 },
        { name: "136 值班室2(2)", hoverText: "136\n值班室2", detailHtml: "房间号：136<br>房间名称：值班室2", pitch: -3.16146226822258, yaw: 246.246109348749 },
        { name: "135 休息室", hoverText: "135\n休息室", detailHtml: "房间号：135<br>房间名称：休息室", pitch: -3.4722262100862213, yaw: 265.6301590487632 },
        { name: "电梯(1-5层)", hoverText: "电梯\n可前往1-5层", detailHtml: "名称：电梯<br>可前往1-5层", pitch: -8.940660323535827, yaw: 316.22496927433093 }
    ],
    "二栋-2f-1": [
        { name: "240 办公室", hoverText: "240\n办公室", detailHtml: "房间号：240<br>房间名称：办公室", pitch: 12.493789302995818, yaw: -125.99784520539181 },
        { name: "弱电间", hoverText: "弱电间", detailHtml: "房间名称：弱电间", pitch: 3.7755174443589414, yaw: -198.9054634824697 },
        { name: "强电间", hoverText: "强电间", detailHtml: "房间名称：强电间", pitch: 3.5449615142076913, yaw: -193.14077046703895 },
        { name: "储藏", hoverText: "储藏", detailHtml: "房间名称：储藏", pitch: 0.5409039459406331, yaw: -188.21143444299577 },
        { name: "231 软件学院软件工程实训基地1", hoverText: "231\n软件学院软件工程实训基地1", detailHtml: "房间号：231<br>房间名称：软件学院软件工程实训基地1", pitch: 6.504222876667626, yaw: -257.7467008472296 },
        { name: "监控室 / 231 软件学院软件工程实训基地2", hoverText: "监控室\n--\n231\n软件学院软件工程实训基地2", detailHtml: "房间名称：监控室<br>----------------------------------------------<br>房间号：231<br>房间名称：软件学院软件工程实训基地2", pitch: -1.0103686073234157, yaw: -269.38850375824455 }
    ],
    "二栋-2f-2": [
        { name: "238 软件学院软件工程实验室", hoverText: "238\n软件学院软件工程实验室", detailHtml: "房间号：238<br>房间名称：软件学院软件工程实验室", pitch: 19.86460406694369, yaw: 49.35753332082408 }
    ],
    "二栋-2f-3": [
        { name: "233 软件学院软件工程实训基地2(1)", hoverText: "233\n软件学院软件工程实训基地2", detailHtml: "房间号：233<br>房间名称：软件学院软件工程实训基地2", pitch: -1.0723235034572145, yaw: 78.75899211910288 },
        { name: "233 软件学院软件工程实训基地2(2)", hoverText: "233\n软件学院软件工程实训基地2", detailHtml: "房间号：233<br>房间名称：软件学院软件工程实训基地2", pitch: -1.6925837355911502, yaw: -83.89361138570207 },
        { name: "饮水机", hoverText: "饮水机", detailHtml: "房间名称：饮水机", pitch: -4.573070623744277, yaw: -98.39293812043556 },
        { name: "洗手间", hoverText: "洗手间", detailHtml: "房间名称：洗手间", pitch: -3.3920726694365504, yaw: -175.23166899007418 },
        { name: "监控室 / 231 软件学院软件工程实训基地1", hoverText: "监控室\n--\n231\n软件学院软件工程实训基地1", detailHtml: "房间名称：监控室<br>----------------------------------------------<br>房间号：231<br>房间名称：软件学院软件工程实训基地1", pitch: 0.2652054690501502, yaw: -274.0916874467569 }
    ],
    "二栋-2f-4": [
        { name: "洗手间", hoverText: "洗手间", detailHtml: "房间名称：洗手间", pitch: -2.482466161760611, yaw: -2.000138654154335 },
        { name: "238 软件学院软件工程实验室(1)", hoverText: "238\n软件学院软件工程实验室", detailHtml: "房间号：238<br>房间名称：软件学院软件工程实验室", pitch: 0.21154832734334084, yaw: -250.2245823992931 },
        { name: "238 软件学院软件工程实验室(2)", hoverText: "238\n软件学院软件工程实验室", detailHtml: "房间号：238<br>房间名称：软件学院软件工程实验室", pitch: -0.4497998774594616, yaw: -189.0379597962503 },
        { name: "监控室", hoverText: "监控室", detailHtml: "房间名称：监控室", pitch: 3.3692264415787365, yaw: -168.67801783940803 }
    ],
    "二栋-2f-5": [
        { name: "238 软件学院软件工程实验室", hoverText: "238\n软件学院软件工程实验室", detailHtml: "房间号：238<br>房间名称：软件学院软件工程实验室", pitch: 0.6646620734494102, yaw: 84.55068201441534 },
        { name: "监控室", hoverText: "监控室", detailHtml: "房间名称：监控室", pitch: 10.247676562080873, yaw: 212.49158614324818 },
        { name: "236 软件学院学生创新基地(1)", hoverText: "236\n软件学院学生创新基地", detailHtml: "房间号：236<br>房间名称：软件学院学生创新基地", pitch: 8.02228886593668, yaw: 241.54626986156114 },
        { name: "236 软件学院学生创新基地(2)", hoverText: "236\n软件学院学生创新基地", detailHtml: "房间号：236<br>房间名称：软件学院学生创新基地", pitch: 1.11850652859507, yaw: 261.39573992287757 },
        { name: "235 软件学院服务器室", hoverText: "235\n软件学院服务器室", detailHtml: "房间号：235<br>房间名称：软件学院服务器室", pitch: 1.3228387894623395, yaw: 270.2079560714718 },
        { name: "电梯(1-5层)", hoverText: "电梯\n可前往1-5层", detailHtml: "名称：电梯<br>可前往1-5层", pitch: -1.1523080292136552, yaw: 293.57256564786366 }
    ],
    "二栋-3f-1": [
        { name: "349 计算中心维修室", hoverText: "349\n计算中心维修室", detailHtml: "房间号：349<br>房间名称：计算中心维修室", pitch: 8.110901370432742, yaw: -108.96739370919603 },
        { name: "弱电间", hoverText: "弱电间", detailHtml: "房间名称：弱电间", pitch: 2.678707037885028, yaw: -196.5490183670142 },
        { name: "强电间", hoverText: "强电间", detailHtml: "房间名称：强电间", pitch: 2.7959069502841434, yaw: -191.32643822561025 },
        { name: "储藏", hoverText: "储藏", detailHtml: "房间名称：储藏", pitch: 2.818962775269868, yaw: -187.1472678020132 },
        { name: "331 计算中心微机室(三)", hoverText: "331\n计算中心微机室(三)", detailHtml: "房间号：331<br>房间名称：计算中心微机室(三)", pitch: 7.802668916978748, yaw: -252.22492202579323 },
        { name: "监控室 / 333 计算中心微机室(四)", hoverText: "监控室\n--\n333\n计算中心微机室(四)", detailHtml: "房间名称：监控室<br>----------------------------------------------<br>房间号：333<br>房间名称：计算中心微机室(四)", pitch: 1.2488319485997819, yaw: -263.3951317778951 }
    ],
    "二栋-3f-2": [
        { name: "339 计算中心会议室(1)", hoverText: "339\n计算中心会议室", detailHtml: "房间号：339<br>房间名称：计算中心会议室", pitch: 15.610371835491135, yaw: 236.51047456772585 },
        { name: "339 计算中心会议室(2)", hoverText: "339\n计算中心会议室", detailHtml: "房间号：339<br>房间名称：计算中心会议室", pitch: 5.230523925219238, yaw: 261.73096867720693 },
        { name: "338B 软件学院嵌入式系统实验室(1)", hoverText: "338B\n软件学院嵌入式系统实验室", detailHtml: "房间号：338B<br>房间名称：软件学院嵌入式系统实验室", pitch: 4.160077519798086, yaw: -84.74057880739218 },
        { name: "主任室", hoverText: "主任室", detailHtml: "房间名称：主任室", pitch: 6.010580817483612, yaw: 101.99236956344987 },
        { name: "专家室", hoverText: "专家室", detailHtml: "房间名称：专家室", pitch: 3.677232379541702, yaw: 95.67452915872468 },
        { name: "教师工作室", hoverText: "教师工作室", detailHtml: "房间名称：教师工作室", pitch: 0.4428569787394392, yaw: 90.49633447272285 },
        { name: "338B 软件学院嵌入式系统实验室(2)", hoverText: "338B\n软件学院嵌入式系统实验室", detailHtml: "房间号：338B<br>房间名称：软件学院嵌入式系统实验室", pitch: 0.5567273139954271, yaw: 79.10317343427904 }
    ],
    "二栋-3f-3": [
        { name: "333 计算中心微机室(四)(1)", hoverText: "333\n计算中心微机室(四)", detailHtml: "房间号：333<br>房间名称：计算中心微机室(四)", pitch: 3.226410721320998, yaw: 80.09793442624158 },
        { name: "333 计算中心微机室(四)(2)", hoverText: "333\n计算中心微机室(四)", detailHtml: "房间号：333<br>房间名称：计算中心微机室(四)", pitch: 1.2371609832082662, yaw: -82.22688885259122 },
        { name: "洗手间", hoverText: "洗手间", detailHtml: "房间名称：洗手间", pitch: 3.96990560151702, yaw: -170.66480066647094 },
        { name: "监控室 / 331 计算中心微机室(三)", hoverText: "监控室\n--\n331\n计算中心微机室(三)", detailHtml: "房间名称：监控室<br>----------------------------------------------<br>房间号：331<br>房间名称：计算中心微机室(三)", pitch: 1.6698310259132576, yaw: -275.57533666373104 }
    ],
    "二栋-3f-4": [
        { name: "副主任室 / 教师工作室(1)", hoverText: "副主任室\n--\n教师工作室", detailHtml: "房间名称：副主任室<br>----------------------------------------------<br>房间名称：教师工作室", pitch: 5.273727167167087, yaw: -11.829641089778372 },
        { name: "教师工作室(2)", hoverText: "教师工作室", detailHtml: "房间名称：教师工作室", pitch: 2.4238291840543837, yaw: -2.9289954483877025 },
        { name: "338A 软件学院数字创意实验室", hoverText: "338A\n软件学院数字创意实验室", detailHtml: "房间号：338A<br>房间名称：软件学院数字创意实验室", pitch: 11.31696147256022, yaw: 24.307939073761425 },
        { name: "338B 软件学院嵌入式系统实验室", hoverText: "338B\n软件学院嵌入式系统实验室", detailHtml: "房间号：338B<br>房间名称：软件学院嵌入式系统实验室", pitch: 0.6763219048655422, yaw: 5.596354401746787 },
        { name: "监控室", hoverText: "监控室", detailHtml: "房间名称：监控室", pitch: 24.418005072562664, yaw: 89.76034419331407 },
        { name: "336 软件学院智能计算实验室(1)", hoverText: "336\n软件学院智能计算实验室", detailHtml: "房间号：336<br>房间名称：软件学院智能计算实验室", pitch: 10.201220562991594, yaw: 158.54913963890905 },
        { name: "336 软件学院智能计算实验室(2)", hoverText: "336\n软件学院智能计算实验室", detailHtml: "房间号：336<br>房间名称：软件学院智能计算实验室", pitch: 2.187588849950682, yaw: 175.23980818657247 },
        { name: "335 计算中心资料室", hoverText: "335\n计算中心资料室", detailHtml: "房间号：335<br>房间名称：计算中心资料室", pitch: 2.736537264835634, yaw: 187.0762044062571 },
        { name: "电梯(1-5层)", hoverText: "电梯\n可前往1-5层", detailHtml: "名称：电梯<br>可前往1-5层", pitch: -0.18886368758413719, yaw: 215.6619221778404 }
    ],
    "二栋-4f-1": [
        { name: "447 印刷电路板实习室", hoverText: "447\n印刷电路板实习室", detailHtml: "房间号：447<br>房间名称：印刷电路板实习室", pitch: 13.324310184810177, yaw: 133.85543252332366 },
        { name: "弱电室", hoverText: "弱电室", detailHtml: "房间名称：弱电室", pitch: 0.781661655435717, yaw: 68.12267136831453 },
        { name: "强电室", hoverText: "强电室", detailHtml: "房间名称：强电室", pitch: 0.16470218721779065, yaw: 74.09200646837911 },
        { name: "储藏", hoverText: "储藏", detailHtml: "房间名称：储藏", pitch: -0.5045689017658292, yaw: 79.54054002402117 },
        { name: "431 电子工艺实习室", hoverText: "431\n电子工艺实习室", detailHtml: "房间号：431<br>房间名称：电子工艺实习室", pitch: 5.134065902039659, yaw: 16.093401946068848 },
        { name: "446", hoverText: "446", detailHtml: "房间号：446", pitch: 1.6420881607329738, yaw: -174.48381115204447 }
    ],
    "二栋-4f-2": [
        { name: "437 创新实验室(1)", hoverText: "437\n创新实验室", detailHtml: "房间号：437<br>房间名称：创新实验室", pitch: 7.355735144441947, yaw: 164.85421037094918 },
        { name: "437 创新实验室(2)", hoverText: "437\n创新实验室", detailHtml: "房间号：437<br>房间名称：创新实验室", pitch: 3.2959217286660634, yaw: 175.93103253435467 },
        { name: "436 电子技术实验室(1)", hoverText: "436\n电子技术实验室", detailHtml: "房间号：436<br>房间名称：电子技术实验室", pitch: 0.550275358581295, yaw: 187.7533291552499 },
        { name: "436 电子技术实验室(2)", hoverText: "436\n电子技术实验室", detailHtml: "房间号：436<br>房间名称：电子技术实验室", pitch: -1.468788661878942, yaw: 355.4135462797137 },
        { name: "438 教师工作室", hoverText: "438\n教师工作室", detailHtml: "房间号：438<br>房间名称：教师工作室", pitch: 7.016915810475001, yaw: 17.296997229640453 },
        { name: "439 教师工作室", hoverText: "439\n教师工作室", detailHtml: "房间号：439<br>房间名称：教师工作室", pitch: 4.842362431979179, yaw: 11.975689067677104 },
        { name: "教师工作室", hoverText: "教师工作室", detailHtml: "房间名称：教师工作室", pitch: 1.8347163747465518, yaw: 7.040509717577554 }
    ],
    "二栋-4f-3": [
        { name: "431 电子工艺实验室(1)", hoverText: "431\n电子工艺实验室", detailHtml: "房间号：431<br>房间名称：电子工艺实验室", pitch: 1.9865389906376318, yaw: -7.343618298711764 },
        { name: "431 电子工艺实验室(2)", hoverText: "431\n电子工艺实验室", detailHtml: "房间号：431<br>房间名称：电子工艺实验室", pitch: 0.0651172558309101, yaw: -171.85599847052868 },
        { name: "洗手间", hoverText: "洗手间", detailHtml: "房间名称：洗手间", pitch: 2.2373515129422192, yaw: -262.4583694005218 }
    ],
    "二栋-4f-4": [
        { name: "电梯(1-5层)", hoverText: "电梯\n可前往1-5层", detailHtml: "名称：电梯<br>可前往1-5层", pitch: 0.4844369037865963, yaw: -148.16738710741765 },
        { name: "432", hoverText: "432", detailHtml: "房间号：432", pitch: 5.972602457199711, yaw: -173.92902797232782 },
        { name: "433 仪器设备室", hoverText: "433\n仪器设备室", detailHtml: "房间号：433<br>房间名称：仪器设备室", pitch: 3.5513194220576505, yaw: -176.90731823944697 },
        { name: "435 服务器室", hoverText: "435\n服务器室", detailHtml: "房间号：435<br>房间名称：服务器室", pitch: 11.897450679192321, yaw: -296.3258024989736 },
        { name: "436 电子技术实验室", hoverText: "436\n电子技术实验室", detailHtml: "房间号：436<br>房间名称：电子技术实验室", pitch: 10.96120607466996, yaw: -339.3262689862763 },
        { name: "434 电子技术实验室(1)", hoverText: "434\n电子技术实验室", detailHtml: "房间号：434<br>房间名称：电子技术实验室", pitch: 8.79703648900784, yaw: -198.6698679744034 },
        { name: "434 电子技术实验室(2)", hoverText: "434\n电子技术实验室", detailHtml: "房间号：434<br>房间名称：电子技术实验室", pitch: 2.318095129317144, yaw: -183.61935551305507 },
        { name: "445 教师工作室", hoverText: "445\n教师工作室", detailHtml: "房间号：445<br>房间名称：教师工作室", pitch: 7.603571603695032, yaw: -12.97537922805154 },
        { name: "444 教师工作室", hoverText: "444\n教师工作室", detailHtml: "房间号：444<br>房间名称：教师工作室", pitch: 6.800097134580956, yaw: -8.985078100783301 },
        { name: "教师工作室", hoverText: "教师工作室", detailHtml: "房间名称：教师工作室", pitch: 5.23333521985481, yaw: -4.600282922140656 }
    ],
    "二栋-5f-1": [
        { name: "538 表面粘装技术实验室", hoverText: "538\n表面粘装技术实验室", detailHtml: "房间号：538<br>房间名称：表面粘装技术实验室", pitch: 14.483839586631728, yaw: -127.440474160591 },
        { name: "537", hoverText: "537", detailHtml: "房间号：537", pitch: 1.7638575136214012, yaw: -83.78218530822303 },
        { name: "弱电室", hoverText: "弱电室", detailHtml: "房间名称：弱电室", pitch: 3.1545282506115697, yaw: -199.9860094829956 },
        { name: "强电室", hoverText: "强电室", detailHtml: "房间名称：强电室", pitch: 2.775250946457523, yaw: -195.4990252355202 },
        { name: "储藏", hoverText: "储藏", detailHtml: "房间名称：储藏", pitch: 1.825063637783527, yaw: -190.45520072559506 },
        { name: "531 EDA实验室", hoverText: "531\nEDA实验室", detailHtml: "房间号：531<br>房间名称：EDA实验室", pitch: 6.618628319841452, yaw: -255.4778927242134 }
    ],
    "二栋-5f-2": [
        { name: "535 电工技术实验室", hoverText: "535\n电工技术实验室", detailHtml: "房间号：535<br>房间名称：电工技术实验室", pitch: 9.278355598165852, yaw: -65.71301388699678 },
        { name: "536 资料室", hoverText: "536\n资料室", detailHtml: "房间号：536<br>房间名称：资料室", pitch: 6.584928930673993, yaw: -109.88323990846452 },
        { name: "办公室", hoverText: "办公室", detailHtml: "房间名称：办公室", pitch: 3.509644909041505, yaw: -252.5816791166333 }
    ],
    "二栋-5f-3": [
        { name: "饮水机", hoverText: "饮水机", detailHtml: "房间名称：饮水机", pitch: -4.199269389189505, yaw: -100.78729736079204 },
        { name: "531 EDA实验室(1)", hoverText: "531\nEDA实验室", detailHtml: "房间号：531<br>房间名称：EDA实验室", pitch: 1.1981126411995735, yaw: -87.74005271314344 },
        { name: "洗手间", hoverText: "洗手间", detailHtml: "房间名称：洗手间", pitch: 3.833060164535823, yaw: -176.76098349698526 },
        { name: "531 EDA实验室(2)", hoverText: "531\nEDA实验室", detailHtml: "房间号：531<br>房间名称：EDA实验室", pitch: 0.7183576518539436, yaw: -286.1530864459832 }
    ],
    "二栋-5f-4": [
        { name: "电梯(1-5层)", hoverText: "电梯\n可前往1-5层", detailHtml: "名称：电梯<br>可前往1-5层", pitch: -0.4339174132158048, yaw: 300.2078543079046 },
        { name: "532", hoverText: "532", detailHtml: "房间号：532", pitch: 2.814214193915051, yaw: 276.10925196013415 },
        { name: "533 虚拟仪器实验室", hoverText: "533\n虚拟仪器实验室", detailHtml: "房间号：533<br>房间名称：虚拟仪器实验室", pitch: 5.316392364772409, yaw: 249.16843497841393 },
        { name: "534", hoverText: "534", detailHtml: "房间号：534", pitch: 13.87668910484881, yaw: 165.2694896139188 },
        { name: "535 电工技术实验室", hoverText: "535\n电工技术实验室", detailHtml: "房间号：535<br>房间名称：电工技术实验室", pitch: 5.678351831167795, yaw: 129.2958654443076 }
    ]
};
